# IFCBuiltInCategoryKey Class

---
A key used to represent an item stored in a template.
SystemObject Autodesk.Revit.DBIFCBuiltInCategoryKey
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class IFCBuiltInCategoryKey : IDisposable

    Public Class IFCBuiltInCategoryKey
    	Implements IDisposable

    public ref class IFCBuiltInCategoryKey : IDisposable

    type IFCBuiltInCategoryKey =
        class
            interface IDisposable
        end
The IFCBuiltInCategoryKey type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the IFCBuiltInCategoryKey
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace